class lostarkInfo {
  List<String> serverList = [
    '전체',
    '루페온',
    '실리안',
    '아만',
    '카마인',
    '카제로스',
    '아브렐슈드',
    '카단',
    '니나브',
  ];

  List<String> raidType = ['전체', '군단장 레이드', '어비스 던전', '카제로스 레이드'];

  List<String> legionRaidList = ['발탄', '비아키스', '쿠크세이튼', '아브렐슈드', '일리아칸', '카멘'];

  List<String> abyssDungeonList = ['카양겔', '혼돈의 상아탑'];

  List<String> kazerosRaidList = ['에키드나'];

  Map<String, dynamic> raidDifficulty = {
    '발탄': ['[노말]', '[하드]', '[헬]'],
    '비아키스': ['[노말]', '[하드]', '[헬]'],
    '쿠크세이튼': ['[노말]', '[하드]', '[헬]'],
    '아브렐슈드': ['[노말]', '[하드]', '[헬]'],
    '일리아칸': ['[노말]', '[하드]'],
    '카멘': ['[노말]', '[하드]', '[더 퍼스트]'],
    '카양겔': ['[노말]', '[하드]'],
    '혼돈의 상아탑': ['[노말]', '[하드]'],
    '에키드나': ['[노말]', '[하드]'],
  };

  Map<String, dynamic> raidMaxPlayer = {
    '발탄': 8,
    '비아키스': 8,
    '쿠크세이튼': 4,
    '아브렐슈드': 8,
    '일리아칸': 8,
    '카멘': 8,
    '카양겔': 4,
    '혼돈의 상아탑': 4,
    '에키드나': 8,
  };
}
